[
  {
    "title": "3 Idiots",
    "industry": "Bollywood",
    "storyline": "Three engineering students form a close friendship as they navigate a rigid academic system and discover the meaning of true success."
  },
  {
    "title": "Baahubali: The Beginning",
    "industry": "Tollywood",
    "storyline": "A man raised in a remote village sets out to discover his true identity, leading him to a kingdom entangled in power struggles and ancient rivalries."
  },
  {
    "title": "Dangal",
    "industry": "Bollywood",
    "storyline": "A former wrestler trains his daughters to become world-class athletes despite social pressure and personal obstacles."
  },
  {
    "title": "RRR",
    "industry": "Tollywood",
    "storyline": "Two revolutionaries fight against colonial rule while maintaining a deep yet hidden connection that shapes their destinies."
  },
  {
    "title": "Chhichhore",
    "industry": "Bollywood",
    "storyline": "After his son faces a life-threatening situation due to academic pressure, a father recalls his own college days with a group of so-called losers. Through their journey of friendship, failure, and fun, he shows that life isn't about winning every time — it's about never giving up."
  },
  {
    "title": "Tamasha",
    "industry": "Bollywood",
    "storyline": "During a vacation in a foreign land, two strangers meet and decide to keep their identities secret, enjoying a few carefree days together. But once they return to their regular lives, the emotional connection they shared begins to clash with the pressures of routine and societal expectations. One of them is forced to face the dullness of a life lived by rules, triggering a journey of self-discovery and inner rebellion."
  },
  {
    "title": "Zindagi Na Milegi Dobara",
    "industry": "Bollywood",
    "storyline": "Three childhood friends go on a bachelor trip across Spain. As they face their deepest fears through adventurous challenges, the journey becomes a turning point in their lives — forcing them to confront love, regret, and the meaning of freedom."
  },
  {
    "title": "Pushpa: The Rise",
    "industry": "Tollywood",
    "storyline": "A low-born man rises from obscurity by entering the dangerous world of red sandalwood smuggling. Facing violence, betrayal, and constant humiliation, he uses his street smarts and daring to challenge the powerful forces that dominate the trade. His climb isn't just about money — it's about earning respect in a world that never gave him any."
  },
  {
    "title": "Taare Zameen Par",
    "industry": "Bollywood",
    "storyline": "A young boy, misunderstood for being lazy and poor in studies, is later found to be struggling with a learning disability. With the help of a compassionate teacher, he discovers his hidden artistic talents and a new way to see the world."
  },
  {
    "title": "Queen",
    "industry": "Bollywood",
    "storyline": "After her marriage falls apart just before the wedding, a young woman decides to go on her honeymoon alone. Exploring Europe by herself for the first time, she finds confidence, friendship, and a new version of herself she never knew existed."
  },
  {
    "title": "Bhool Bhulaiyaa",
    "industry": "Bollywood",
    "storyline": "A newly married couple returns from abroad and decides to live in their ancestral palace, brushing off local warnings about it being haunted. But soon, strange events begin — voices in the night, shifting personalities, and unexplainable behavior. To get to the bottom of the mystery, a quirky, unconventional psychiatrist is brought in. What follows is a clever mix of psychological intrigue, cultural beliefs, and hilarious twists that blur the line between superstition and science."
  },
  {
    "title": "Golmaal: Fun Unlimited",
    "industry": "Bollywood",
    "storyline": "A group of mischievous friends hides in the house of a blind couple by pretending to be their long-lost grandson. Their wild lies turn into hilarious chaos as more people get involved in their game."
  },
  {
    "title": "Stree",
    "industry": "Bollywood",
    "storyline": "In a small town, men mysteriously vanish during a festival — supposedly kidnapped by the spirit of a woman. A local tailor and his quirky friends get caught in the chaos, trying to uncover whether it's superstition or something truly supernatural. It’s horror with a hilarious twist."
  },
  {
    "title": "Luka Chuppi",
    "industry": "Bollywood",
    "storyline": "A young couple in a small town decides to live together before getting married — secretly. But when their families find out, they're forced to pretend they are married, leading to one lie after another in a laugh-filled tangle of tradition and modern values."
  },
  {
    "title": "Badhaai Ho",
    "industry": "Bollywood",
    "storyline": "A young man is shocked and embarrassed to learn that his middle-aged parents are expecting a baby. As relatives gossip and his love life suffers, the family learns to deal with awkwardness, social judgment, and unexpected joy — all with plenty of humor."
  }
]